In [8]:
import pandas as pd

years = [2020, 2021, 2021, 2022, 2023]
months = [1, 2, 9, 3, 4]
days = [5, 6, 5, 7, 8]
expenses = [1000, 1050, 1069,  980, 1115]

df = pd.DataFrame({'year': years, 'month': months, 'day': days, 'expenses': expenses})
df

   year  month  day  expenses
0  2020      1    5      1000
1  2021      2    6      1050
2  2021      9    5      1069
3  2022      3    7       980
4  2023      4    8      1115

How to select **certain columns** from **certain rows**

In [10]:
df[df['year'] == 2021][['day','month']]

   day  month
1    6      2
2    5      9

Drop duplicates

In [12]:
df.drop_duplicates(subset='year', inplace = True)
df

   year  month  day  expenses
0  2020      1    5      1000
1  2021      2    6      1050
3  2022      3    7       980
4  2023      4    8      1115